// - Користувач вводить або має два числа.
//     Потрібно знайти та вивести максимальне число з тих двох .
//     Також потрібно врахувати коли введені рівні числа.

// let number_1 = +prompt('Введіть перше число');
// let number_2 = +prompt('Введіть друге число');
//
// if (number_1 > number_2) {
//     console.log(number_1);
// } else if (number_1 === number_2) {
//     console.log('Числа рівні');
// } else {
//     console.log(number_2);
// }

// - У першому під'їзді квартири з 1 до 20. У другому з 21 по 48. У третьому з 49 по 90.
// Користувач вводить номер квартири просто в змінні або через prompt('') .
//     Програма повинна зазначити, в якому під'їзді знаходиться дана квартира.

// let apartment = prompt('Введіть номер квартири')
//
// if (apartment >= 1 && apartment <= 20) {
//     console.log('Ця квартира у першому підїзді');
// } else if (apartment >= 21 && apartment <= 48) {
//     console.log('Ця квартира у другому підїзді');
// } else if (apartment >= 49 && apartment <= 90) {
//     console.log('Ця квартира у третьому підїзді');
// } else {
//     console.log('Ви помилилися.');
// }

// - Ми маємо змінну number в яку користувач задає числове значення,  якщо змінна рівна 10 вивести повідомлення ВІРНО, якщо змінна не рівна 10 - тоді НЕВІРНО

// let number = +prompt('Введіть число');
//
// if (number === 10) {
//     console.log('ВІРНО');
// } else {
//     console.log('НЕВІРНО');
// }

// let number = (+prompt('Введіть число') === 10) ? console.log('ВІРНО') : console.log('НЕВІРНО');

// - Задача-гра "чи ми йдемо сьогодні в OKTEN на навчання?".
//     Змінна, яка характеризує температуру. Якщо температура від +10 до +22 вивести повідомлення що ми йдемо ВЧИТИСЯ .
//     Якщо інша темпаретура, тоді виводимо повідомлення що сидимо вдома і вчимося ОНЛАЙН

// let t = Math.round(Math.random()* 100 + (-50));
//
// if (t >= 10 && t <= 22) {
//     console.log('Mи йдемо ВЧИТИСЯ')
// } else {
//     console.log('Сидимо вдома і вчимося ОНЛАЙН');
// }

// - За допомогою switch case - реалізувати гру - вікторину, де ми вводимо число від 1 до 5. І взалежності від введеного
//     числа нам дається приз. (Авто, Мото, Телефон, і т.д ) і якщо число не підходить тоді  вивести Повідомлення - що число не вірне ... .

// let value = +prompt('Введіть число від 1 до 5');
//
// switch (value) {
//     case 1:
//         console.log('Ви виграли авто');
//         break;
//     case 2:
//         console.log('Ви виграли телефон');
//         break;
//     case 3:
//         console.log('Ви виграли набір кухонного посуду');
//         break;
//     case 4:
//         console.log('Ви виграли квартиру');
//         break;
//     case 5:
//         console.log('Ви виграли дірку від бублика');
//         break;
//     default:
//         console.log('Число не вірне');
// }