// - Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить, до якої четверті години попадає число
// (в першу, другу, третю или четверту частину години).

// let time = prompt('Скільки зараз хвилин?');
//
// if (time < 15) {
//     console.log('Перша четверть');
// } else if (time >= 15 && time < 30) {
//     console.log('Друга четверть');
// } else if (time >= 30 && time < 45) {
//     console.log('Третя четверть');
// } else if (time >= 45 && time <= 59) {
//     console.log('Четверта четверть');
// } else {
//     console.log('Тобі час спати!');
// }

// - У змінній day дано якесь число від 1 до 31. Потрібно визначити, у яку половину(декаду) місяця потрапляє це число (у першу, другу чи третю).

// let day = prompt('Яке сьогодні число?');
//
// if (day >= 1 && day <= 10) {
//     console.log('Перша декада');
// } else if (day > 10 && day <= 20) {
//     console.log('Друга декада');
// } else if (day > 20 && day <= 30) {
//     console.log('Третя декада');
// } else if (day == 31) {     // з оператором "===" це число не виводить, якщо не важко поясніть чому
//     console.log('Останній день місяця');
// } else {
//     console.log('Не поспішай, Мюнхаузене!');
// }

// - У нас є змінна test, якщо дорівнює true, виведіть 'Вірно', інакше виведіть 'Неправильно'.
//     Перевірте роботу скрипта при test, що дорівнює true, false. Напишіть два варіанти скрипта - з коротким записом(тернаркою)

// let test = ' ';
//
// if (!!test === true) {
//     console.log('Вірно');
// } else {
//     console.log('Неправильно');
// }

// let test = !true ? 'Вірно' : 'Неправильно';
// console.log(test);

// - Якщо змінна a не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'. Перевірте  скрипт при a, що дорівнює 1, 0, -3

// let a = +prompt('Введіть одне з чисел: 1, 0, -3');
//
// if (a !== 0) {
//     console.log('Вірно');
// } else {
//     console.log('Невірно');
// }

// - Скласти розклад на тиждень за домопоги switch. Користувач вводить порядковий номер дня тижня і на екрані відображається інфа що заплановано на цей день.

// let i = prompt('Введіть номер тижня');
//
// switch (i) {
//     case '1':
//         console.log('Заперечення. Як понеділок? Вчора була тільки пятниця!!!');
//         break;
//     case '2':
//         console.log('Гнів. Ненавиджу вівторки. В цей день завжди найбільше роботи.');
//         break;
//     case '3':
//         console.log('Торг. А може я сьогодні відпочину, а завтра зроблю одразу все?');
//         break;
//     case '4':
//         console.log('Депресія. Ні-і-і, в мене нічого не вийде...');
//         break;
//     case '5':
//         console.log('Прийнятя. Ну нічого, хоч роботи багато, але з часом все одно зроблю.');
//         break;
//     case '6':
//         console.log('Ура! Нарешті я відпочину.');
//         break;
//     case '7':
//         console.log('Тобто завтра понеділок?');
//         break;
//     default:
//         console.log('Друже, ти запрацювався!')
//
// }

// - Потрібно визначити Високосний рік чи ні. Високосні роки діляться націло на 4.

// let year = +prompt('Введіть, яка кількість днів у році');
//
// if (year % 4 === 0) {
//     console.log('Цей рік високосний!');
// } else {
//     console.log('Ні-і. Рік не високосний.')
// }

// - Використовуючи конструкцію if..else, напишіть код, який запитуватиме: „Яка «офіційна» назва JavaScript?“
// Якщо користувач вводить «ECMAScript», то показати: «Правильно!», інакше – відобразити: «Не знаєте? ECMAScript!

// let officialName = prompt('Яка «офіційна» назва JavaScript?');
//
// if (officialName === 'ECMAScript') {
//     console.log('Правильно!');
// } else {
//     console.log('Не знаєте? ECMAScript!');
// }